# Web Layer
convert.pathVariableCannotBeConvertedToLotteryType=Az \u00FAtvonal v\u00E1ltoz\u00F3 nem konvert\u00E1lhat\u00F3 LotteryType t\u00EDpuss\u00E1: {0}
convert.requestParamCannotBeConvertedToGeneratorType=A k\u00E9r\u00E9s param\u00E9ter nem konvert\u00E1lhat\u00F3 GeneratorType t\u00EDpuss\u00E1: {0}

# Custom validation constraint messages
validate.generator.upperLimitMustBeLargerThanLower=A fels\u0151 hat\u00E1rnak nagyobbnak kell lennie mint az als\u00F3 hat\u00E1rnak. Als\u00F3 hat\u00E1r: {0}, fels\u0151 hat\u00E1r: {1}
validate.generator.usedPartitionsMustBeLargerThan1=A haszn\u00E1lt part\u00EDci\u00F3k sz\u00E1m\u00E1nak nagyobbnak kell lennie mint 1. Haszn\u00E1lt part\u00EDci\u00F3k: {0}
validate.generator.numberOfPartitionsMustBeLargerThanUsed=A part\u00EDci\u00F3k sz\u00E1m\u00E1nak nagyobbnak kell lennie mint a haszn\u00E1lt part\u00EDci\u00F3k sz\u00E1m\u00E1nak. Part\u00EDci\u00F3k sz\u00E1ma: {0}, haszn\u00E1lt paart\u00EDci\u00F3k sz\u00E1ma: {1}
validate.generator.setOfNumbersMustBeLargerThanPartitions=A sz\u00E1mok halmaz\u00E1nak nagyobbnak kell lennie mint a part\u00EDci\u00F3k sz\u00E1m\u00E1nak \u00E9s a marad\u00E9kos oszt\u00E1suknak 0-nak kell lennie \u00E9s a part\u00EDci\u00F3k sz\u00E1m\u00E1nak nagyobbnak kell lennie mint a haszn\u00E1lt part\u00EDci\u00F3k sz\u00E1ma. Sz\u00E1mok halmaza: {0}, part\u00EDci\u00F3k sz\u00E1ma: {1}, haszn\u00E1lt part\u00EDci\u00F3k: {2}
validate.generator.quantityAndUpperLimitCannotBeSmallerThan1=A h\u00FAzott sz\u00E1mok mennyis\u00E9ge \u00E9s a fels\u0151 hat\u00E1r nem lehet kisebb mint 1
validate.generator.poolSizeMustNotBeLargerThan=A sz\u00E1mk\u00E9szlet nem lehet nagyobb mint {0}. Sz\u00E1mk\u00E9szlet: {1}
validate.generator.poolSizeMustBeLargerThanQuantity=A sz\u00E1mk\u00E9szletnek nagyobbnak kell lennie mint a h\u00FAzott sz\u00E1moknak. H\u00FAzott sz\u00E1mok: {0}, sz\u00E1mk\u00E9szlet: {1}
validate.generator.quantityMustNotBe0=A h\u00FAzott sz\u00E1mok sz\u00E1ma nem lehet 0
validate.generator.poolSizeMustNotBe0=A sz\u00E1mk\u00E9szlet nem lehet 0
validate.generator.unsupportedOperation=Nem t\u00E1mogatott m\u0171velet
validate.generator.onlyQuantity5PoolSize90Supported=H\u00FAzott sz\u00E1mok sz\u00E1ma {0} \u00E9s sz\u00E1mk\u00E9szlet {1} egy\u00FCtt nem t\u00E1mogatott. Csak h\u00FAzott sz\u00E1mok sz\u00E1ma 5 \u00E9s sz\u00E1mk\u00E9szlet 90 egy\u00FCtt t\u00E1mogatott k\u00EDs\u00E9rleti gener\u00E1tor t\u00EDpussal
validate.generator.onlyFiveOutOfNinetyLotteryTypeSupported=Csak \u00D6t\u00F6slott\u00F3 lott\u00F3 t\u00EDpus t\u00E1mogatott k\u00EDs\u00E9rleti gener\u00E1tor t\u00EDpussal
validate.generator.inputParameterNotAppropriate=A bemeneti paaram\u00E9ter nem megfelel\u0151